Revit 2027 API
ParameterTypeId.BendingDetailTypeAngularDimensionsForCranksEnabled Property
 "Crank Angles"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeAngularDimensionsForCranksEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionsForCranksEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionsForCranksEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeAngularDimensionsForCranksEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace